app/Controllers/Note.php

INSERT INTO `notes` (`title`, `content`, `created_at`, `updated_at`) VALUES ('taindwind component ui tamplate [vanilla]', 'df gdfg dfg dgdf', '2024-04-10 03:10:36', '2024-04-10 03:10:36')
---
    public function store()
    {
        // dd($this->request->getPost());
        $rules = [
            'title' => 'required|min_length[5]|max_length[255]',
            'content' => 'required'
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'title' => $this->request->getPost('title'),
            'content' => $this->request->getPost('content'),
        ];
        $note = $this->notes->insert($data);