app/Models/NotesModel.php

SELECT *
FROM `notes`
---
    public function getNotes()
    {
        return $this->findAll();